/*
 * 1、忽略数字、字母以外的其他字符，遇到这些字符指针向下遍历
 * 2、检查两个字符，遇到数字要相等；遇到字母要大小写“相等”
 */

bool isPalindrome(char* s) {
    int i = 0, j = strlen(s) - 1;

    if(j < 1)    return true;

    while(i <= j){
        // i 指向除字母除数字外的其他字符时，忽略
        if(!('0' <= s[i] && s[i] <= '9') &&
            !('A' <= s[i] && s[i] <= 'Z') &&
            !('a' <= s[i] && s[i] <= 'z'))
            {
                ++i; continue;
            }
        // j 指向除字母除数字外的其他字符时，忽略
        if(!('0' <= s[j] && s[j] <= '9') &&
            !('A' <= s[j] && s[j] <= 'Z') &&
            !('a' <= s[j] && s[j] <= 'z'))
            {
                --j; continue;
            }
        
        // ij所指向的字符是数字时，相同就继续遍历
        // ij所指向的字符是字母时，大小写“相同”就继续遍历
        if(s[i] == s[j] ||
            (s[i] - s[j]) % 32 == 0 &&
            !('0' <= s[i] && s[i] <= '9') &&
            !('0' <= s[j] && s[j] <= '9'))
            {
                ++i; --j;
            }
        else return false;
    }

    return true;
}